// function problem (number)  {
//     let sum = 0
//     let three = 2
//     if (sum < number) {
//         sum += 3
//     }
//     console.log(sum)
// }
//
// console.log(problem(12))

// Дан массив целых чисел, найдите то, которое встречается нечетное количество раз.
//
//     Всегда будет только одно целое число, которое встречается нечетное количество раз.
//
//     Примеры
//     [7]должен вернуть 7, потому что это происходит 1 раз (что нечетно).
// [0]должен вернуть 0, потому что это происходит 1 раз (что нечетно).
// [1,1,2]должен вернуть 2, потому что это происходит 1 раз (что нечетно).
// [0,1,0,1,0]должен вернуть 0, потому что он встречается 3 раза (что нечетно).
// [1,2,2,3,3,3,4,3,3,3,2,2,1]должен вернуть 4, потому что он появляется 1 раз (что нечетно).


//
// function findOdd(A) {
//     let b = []
// for (let i = 0; i < A.length; i++) {
//     let oddInt = A.filter(function (odd){
//         let b = A[i]
//         if (A[i].length % 2 === 0) {
//             console.log(A[i][0])
//        }
//     })
// }
// }
//
// console.log( findOdd([21,20]))

