// // Обычно, когда вы что-то покупаете, вас спрашивают,
// //     верны ли номер вашей кредитной карты, номер телефона
// // или ответ на ваш самый секретный вопрос. Однако, поскольку
// // кто-то может заглянуть вам через плечо, вы не хотите, чтобы это
// // отображалось на вашем экране. Вместо этого мы маскируем его.
// //
// //     Ваша задача — написать функцию maskify, которая
// // заменяет все символы, кроме последних четырех, на '#'.
//
// // return masked string
// function maskify(cc) {
//
// }

